FKDD_COPY_DIFF_3_2026-02-14/Documents/ОтчетДистрибьютораОПродажеАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтчетДистрибьютораОПродажеАвтомобилей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТ_ОстаткиВозмещений</xr:Item>
				<xr:Item>InformationRegister.тт_Возмещения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаВозмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПрограмм</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСкидокНаАвтомобиль</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидкиПодтвержденная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозмещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоздатьЗаписьОПродаже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентПрограммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/тт_Возмещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>тт_Возмещения</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусВозмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТ_СтатусыВозмещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ОтчетДистрибьютораОПродажеАвтомобилей/Ext/ObjectModule.bsl
Функция АвтомобильОтчитан(АвтоИст,СкидкаИст) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тт_Возмещения.Автомобиль,
		|	тт_Возмещения.СтатусВозмещения,
		|	тт_Возмещения.Скидка,
		|	тт_Возмещения.СуммаВозмещения
		|ИЗ
		|	РегистрСведений.тт_Возмещения КАК тт_Возмещения
		|ГДЕ
		|	тт_Возмещения.Автомобиль = &Автомобиль
		|	И тт_Возмещения.СтатусВозмещения <> &СтатусВозмещения
		|	И тт_Возмещения.Скидка = &Скидка";
	
	Запрос.УстановитьПараметр("Автомобиль", АвтоИст);
	Запрос.УстановитьПараметр("Скидка", СкидкаИст);
	Запрос.УстановитьПараметр("СтатусВозмещения", Справочники.ТТ_СтатусыВозмещений.Продажа);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//БизТех Горковенко П.А. 21.10.25 ++

	//Дата=ТекущаяДата();	
	//
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
	//	
	//	// Заполнение шапки
	//	Организация = ДанныеЗаполнения.Организация;
	//	ПодразделениеКомпании = ДанныеЗаполнения.ПодразделениеКомпании;
	//	ДокументОснование = ДанныеЗаполнения.Ссылка;
	//	Скидки.Очистить();		

	//	РС=РегистрыСведений.тт_Возмещения.СоздатьНаборЗаписей();
	//	РС.Отбор.Регистратор.Установить(ДанныеЗаполнения);
	//	РС.Прочитать();
	//			
	//	ЕстьВозмещение = Ложь;
	//	Для каждого Зап из РС Цикл
	//		Если ЗначениеЗаполнено(Зап.Скидка.Родитель) Тогда
	//			Если Зап.Скидка.МаркетинговаяПрограмма=1 и Зап.Скидка.ПринадлежитЭлементу(Справочники.ТипыСкидокНаАвтомобиль.НайтиПоКоду("00698")) Тогда
	//				ЕстьВозмещение=Истина;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Для каждого Зап из РС Цикл
	//		
	//		Если АвтомобильОтчитан(Зап.Автомобиль,Зап.Скидка) Тогда
	//			Сообщить("По автомобилю "+Зап.Автомобиль+" уже был отчет по возмещениям, по программе "+Зап.Скидка);
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Если Контрагент.Ссылка.Пустая() И НЕ Зап.Скидка.Контрагент.Ссылка.Пустая() Тогда
	//			Контрагент = Зап.Скидка.Контрагент;
	//		КонецЕсли;
	//		
	//		Если Зап.СтатусВозмещения = Справочники.ТТ_СтатусыВозмещений.Продажа Тогда
	//			Если ЗначениеЗаполнено(Зап.Скидка.Родитель) Тогда
	//				Если Зап.Скидка.ПринадлежитЭлементу(Справочники.ТипыСкидокНаАвтомобиль.НайтиПоКоду("00698")) И НЕ ЕстьВозмещение Тогда
	//					НовСтр = Скидки.Добавить();
	//					НовСтр.Автомобиль = Зап.Автомобиль;
	//					НовСтр.Скидка = Зап.Скидка;
	//					НовСтр.СуммаВозмещения = Зап.СуммаВозмещения;
	//					НовСтр.СтавкаНДС = Зап.Скидка.СтавкаНДС;
	//					НовСтр.СуммаНДС = НовСтр.СуммаВозмещения*НовСтр.СтавкаНДС.Ставка/(100+НовСтр.СтавкаНДС.Ставка);
	//				КонецЕсли;
	//				Если НЕ Зап.Скидка.ПринадлежитЭлементу(Справочники.ТипыСкидокНаАвтомобиль.НайтиПоКоду("00698")) Тогда
	//					НовСтр = Скидки.Добавить();
	//					НовСтр.Автомобиль = Зап.Автомобиль;
	//					НовСтр.Скидка = Зап.Скидка;
	//					НовСтр.СуммаВозмещения = Зап.СуммаВозмещения;
	//					НовСтр.СтавкаНДС = Зап.Скидка.СтавкаНДС;
	//					НовСтр.СуммаНДС = НовСтр.СуммаВозмещения*НовСтр.СтавкаНДС.Ставка/(100+НовСтр.СтавкаНДС.Ставка);
	//				КонецЕсли;	
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если Скидки.Количество()=0 Тогда
	//		Для каждого Стр из ДанныеЗаполнения.Автомобили Цикл
	//			НовСтр = Скидки.Добавить();
	//			НовСтр.Автомобиль = Стр.Автомобиль;
	//			НовСтр.Скидка = Справочники.ТипыСкидокНаАвтомобиль.ОтчетБезВозмещения;
	//			НовСтр.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	//		КонецЦикла;
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
	//		
	//		РС=РегистрыСведений.тт_СкидкиНаАвтомобиль.СоздатьНаборЗаписей();
	//		РС.Отбор.Объект.Установить(ДанныеЗаполнения.ДокументОснование);
	//		РС.Прочитать();
	//		
	//		Для каждого Зап из РС Цикл
	//			Если зап.СуммаВозмещения>0 Тогда
	//				Если Скидки.Найти(Зап.Скидка,"Скидка") = Неопределено Тогда
	//					НовСтр = Скидки.Добавить();
	//					НовСтр.Автомобиль = Зап.Объект.Автомобиль;
	//					НовСтр.Скидка = Зап.Скидка;
	//					НовСтр.СуммаВозмещения = Зап.СуммаВозмещения;
	//					НовСтр.СтавкаНДС = Зап.Скидка.СтавкаНДС;
	//					НовСтр.СуммаНДС = НовСтр.СуммаВозмещения*НовСтр.СтавкаНДС.Ставка/(100+НовСтр.СтавкаНДС.Ставка);
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Если обЗначениеНеЗаполнено(Организация) Тогда
	//	Организация=ПараметрыСеанса.Организация;
	//КонецЕсли;
	//
	//Если обЗначениеНеЗаполнено(ПодразделениеКомпании) Тогда
	//	ПодразделениеКомпании=ПараметрыСеанса.ПодразделениеКомпании;		
	//КонецЕсли;
	//
	//Автор=ПараметрыСеанса.Пользователь;  
	
	//БизТех Горковенко П.А. 21.10.25 --
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	ХозОперация=Справочники.ХозОперации.ОтчетНаВозмещениеДистрибьютора;	
	Автор=ПараметрыСеанса.Пользователь; //БизТех Горковенко П.А. 21.10.25 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПрограммаВозм = Новый СписокЗначений;
	Если ЗначениеЗаполнено(СписокПрограмм) Тогда
        Попытка
            СписокИзХранилища = СписокПрограмм.Получить();
			Если ТипЗнч(СписокИзХранилища) = Тип("СписокЗначений") Тогда
                ПрограммаВозм = СписокИзХранилища;
            КонецЕсли;
        Исключение
            Сообщить("Ошибка при восстановлении списка: " + ОписаниеОшибки());
        КонецПопытки;
	КонецЕсли;
	КоличествоПрограмм = 0;    
	СчетчикПрограммПоКонтрагенту = 0;
	СчетчикПоПрограммам = 0;
	
	Для Каждого Стр из Скидки Цикл
		
		Если обЗначениеНеЗаполнено(Стр.Автомобиль) Тогда
			Сообщить("В строке № "+Стр.НомерСтроки+" не заполнен Автомобиль! Запись прервана.");
			Отказ=Истина;
			Продолжить;
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(Стр.Скидка) Тогда
			Сообщить("В строке № "+Стр.НомерСтроки+" не заполнен Тип скидки! Запись прервана.");
			Отказ=Истина;
			Продолжить;
		КонецЕсли;
		
		Если Стр.Скидка.ДатаОкончания < Дата Тогда
			Сообщить("В строке № "+Стр.НомерСтроки+" действие программы возмещения закончилось "+ Формат(Стр.Скидка.ДатаОкончания,"ДФ=dd.MM.yyyy")+"! Запись прервана.");
			Отказ=Истина;
		КонецЕсли;
		
		Если Стр.Скидка.ДатаНачала > Дата Тогда
			Сообщить("В строке № "+Стр.НомерСтроки+" действие программы возмещения начинается "+ Формат(Стр.Скидка.ДатаНачала,"ДФ=dd.MM.yyyy")+"! Запись прервана.");
			Отказ=Истина;
		КонецЕсли; 
		
		// БизТех Горковенко П.А. 22.10.25 ++ 
		Для Каждого строка Из ПрограммаВозм Цикл 
			КоличествоПрограмм = КоличествоПрограмм+ 1;
			Если НЕ Стр.Автомобиль.Поставщик = строка.Значение.Контрагент Тогда 
				СчетчикПрограммПоКонтрагенту = СчетчикПрограммПоКонтрагенту+ 1;	
			КонецЕсли;
			Если НЕ Стр.Скидка = строка.Значение Тогда
				СчетчикПоПрограммам= СчетчикПоПрограммам+ 1;
			КонецЕсли; 
		КонецЦикла;   
		Если СчетчикПрограммПоКонтрагенту = КоличествоПрограмм Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Автомобиль " + Стр.Автомобиль 
			+" имеет импортера отличный от контрагента программы возмещения " + строка.Значение
			+ ". Проверьте указанные данные!";  
			Сообщение.Сообщить();  
			//Отказ = Истина;
			//Продолжить;  
		КонецЕсли;
		Если СчетчикПоПрограммам = КоличествоПрограмм Тогда			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Автомобиль " + Стр.Автомобиль 
			+" имеет программу возмещения отличную от программы возмещения документа (" + строка.Значение
			+ "). Проверьте указанные данные!";  
			Сообщение.Сообщить();
			//Отказ = Истина;
			//Продолжить;
		КонецЕсли;
		
		//Если НЕ Стр.Автомобиль.Поставщик = ПрограммаВозмещения.Контрагент Тогда 
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Автомобиль " + Стр.Автомобиль 
		//	+" имеет импортера отличный от контрагента программы возмещения " + ПрограммаВозмещения
		//	+ ". Проверьте указанные данные!";  
		//	Сообщение.Сообщить();  
		//	Отказ = Истина;
		//	Продолжить;
		//КонецЕсли;  
		//Если НЕ Стр.Скидка = ПрограммаВозмещения Тогда 
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Автомобиль " + Стр.Автомобиль 
		//	+" имеет программу возмещения отличную от программы возмещения документа (" + ПрограммаВозмещения
		//	+ "). Проверьте указанные данные!";  
		//	Сообщение.Сообщить();
		//	Отказ = Истина;
		//	Продолжить;
		//КонецЕсли;
		// БизТех Горковенко П.А. 22.10.25 --


		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТТ_ОстаткиВозмещенийОбороты.Регистратор
		|ИЗ
		|	РегистрНакопления.ТТ_ОстаткиВозмещений.Обороты(, , Регистратор, ) КАК ТТ_ОстаткиВозмещенийОбороты
		|ГДЕ
		|	ТТ_ОстаткиВозмещенийОбороты.СуммаПриход > 0
		|	И ТИПЗНАЧЕНИЯ(ТТ_ОстаткиВозмещенийОбороты.Регистратор) = ТИП(Документ.ОтчетДистрибьютораОПродажеАвтомобилей)
		|	И ТТ_ОстаткиВозмещенийОбороты.Автомобиль = &Автомобиль
		//|	И ТТ_ОстаткиВозмещенийОбороты.ТипСкидки = &ТипСкидки
		|	И ТТ_ОстаткиВозмещенийОбороты.Регистратор <> &Ссылка";
		Запрос.УстановитьПараметр("Автомобиль", Стр.Автомобиль);
		//Запрос.УстановитьПараметр("ТипСкидки", Стр.Скидка);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("Запись прервана! Автомобиль "+Стр.Автомобиль+" уже отчитан.
			|Редактирование осущ-ся документом Корректировка отчета дистрибьютора");
			Если НЕ РольДоступна("ПолныеПрава") Тогда
				Отказ=Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Стр.Скидка.Организация <> Организация Тогда
			
			Сообщить("Организация документа не соответствует Организации программы возмещения "+Стр.Скидка+". Автомобиль "+Стр.Автомобиль);
			
			Если НЕ РольДоступна("ПолныеПрава") Тогда
				Отказ=Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	НаборЗаписей = РегистрыСведений.тт_Возмещения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Очистить();
	
	Для каждого Стр из Скидки Цикл
		
		Если обЗначениеНеЗаполнено(Стр.Автомобиль) Тогда
			Сообщить("В строке № "+Стр.НомерСтроки+" не заполнен Автомобиль! Запись прервана.");
			Отказ=Истина;
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(Стр.Скидка) Тогда
			Сообщить("В строке № "+Стр.НомерСтроки+" не заполнен Тип скидки! Запись прервана.");
			Отказ=Истина;
		КонецЕсли;
		
		Движения.ТТ_ОстаткиВозмещений.Записывать=Истина;
		Движ=Движения.ТТ_ОстаткиВозмещений.Добавить();	
		Движ.Период=ЭтотОбъект.Дата;
		дВиж.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движ.Автомобиль=Стр.Автомобиль;
		Движ.Поставщик = Стр.Скидка.Контрагент;
		Движ.ТипСкидки=Стр.Скидка;
		Движ.Сумма=Стр.СуммаВозмещения;
		Движ.СуммаНДС = Стр.СуммаНДС;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Автомобиль = Стр.Автомобиль;
		НоваяЗапись.СтатусВозмещения = Справочники.ТТ_СтатусыВозмещений.Отчет;
		НоваяЗапись.Скидка = Стр.Скидка;
		НоваяЗапись.Период = Ссылка.Дата;
		НоваяЗапись.СуммаВозмещения = Стр.СуммаВозмещения;
		НоваяЗапись.СуммаНДС = Стр.СуммаНДС;
		
		//Создание записи о продаже
		Если Стр.СоздатьЗаписьОПродаже Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	тт_ВозмещенияСрезПоследних.Автомобиль
			|ИЗ
			|	РегистрСведений.тт_Возмещения.СрезПоследних КАК тт_ВозмещенияСрезПоследних
			|ГДЕ
			|	тт_ВозмещенияСрезПоследних.СтатусВозмещения = &СтатусВозмещения
			|	И тт_ВозмещенияСрезПоследних.Автомобиль = &Автомобиль
			|	И тт_ВозмещенияСрезПоследних.Регистратор <> &Регистратор";
			
			Запрос.УстановитьПараметр("СтатусВозмещения", Справочники.ТТ_СтатусыВозмещений.Продажа);
			Запрос.УстановитьПараметр("Автомобиль", Стр.Автомобиль);
			Запрос.УстановитьПараметр("Регистратор", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			
			Если РезультатЗапроса.Количество() = 0 Тогда
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Автомобиль = Стр.Автомобиль;
				НоваяЗапись.СтатусВозмещения = Справочники.ТТ_СтатусыВозмещений.Продажа;
				НоваяЗапись.Период = Ссылка.Дата;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
	НаборЗаписей.Записать(ИСТИНА);
	
КонецПроцедуры
